In [2]:
import pandas as pd

In [7]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [8]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [11]:
frame.size

24

In [13]:
frame.shape

(6, 4)

In [17]:
frame['col2'] = (False, False, False, False, False, False)

In [18]:
frame

              Name       Birth       City  Position    col   col2
0      Иванов А.А.  22.03.1980     Москва       NaN  False  False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер  False  False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False  False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False  False
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False  False
5     Костров С.О.  31.05.1985     Москва    стажер  False  False

In [19]:
import numpy as np

In [20]:
x = range(10)

In [21]:
y = np.array(x)

In [22]:
y

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [23]:
type(y)

numpy.ndarray

In [24]:
y>3

array([False, False, False, False,  True,  True,  True,  True,  True,
        True])

In [31]:
y = map(lambda y: y * 5, x)

In [34]:
print(list(y))

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45]